Revit 2027 API
BuiltInFailures.PerformanceFailures.TooManyElementsInSketch Property
 Sketch of <element> contains too many objects - it may take long time to solve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManyElementsInSketch { get; }
Public Shared ReadOnly Property TooManyElementsInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManyElementsInSketch {
	FailureDefinitionId^ get ();
}
static member TooManyElementsInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace